Link interactive architecture diagrams
